/*
 * Авторское право принадлежит Антону Александровичу Астафьеву <anton@astafiev.me> (Anton Astafiev) ѱ.
 * Все права защищены и охраняются законом.
 * Copyright (c) 2016 Антон Александрович Астафьев <anton@astafiev.me> (Anton Astafiev). All rights reserved.
 * 
 *  Собственная лицензия Астафьева
 * Данный программный код является собственностью Астафьева Антона Александровича
 * и может быть использован только с его личного разрешения
 */

пакет org.elliptica.ling;

внеся java.util.Множество;
внеся java.util.Список;

/**
 *
 * @author Антон Астафьев <anton@astafiev.me> (Anton Astafiev)
 */
доступный сопряжение Парадигма {

	логическое былоНайдено();

	Строка дайБазовуюФорму();

	ЧастьРечи дайЧастьРечи();

	Множество<Граммема> дайГраммемы();

	Список<ФормаСлова> формы();

	@Подмени
	Строка toString();

}
