/*
 *  Лицензия Астафьева
 * Данный программный код является собственностью Астафьева Антона Александровича
 * и может быть использован только с его личного разрешения
 */
пакет org.elliptica.ling;

внеси java.util.Список;
внеси java.util.Множество;

/**
 *
 * @author Антон Астафьев <anton@astafiev.me> (Anton Astafiev)
 */
доступный сопряжение Парадигма {

	логическое былоНайдено();

	Строка дайБазовуюФорму();

	ЧастьРечи дайЧастьРечи();

	Множество<Граммема> дайГраммемы();

	Список<ФормаСлова> формы();

	@Подмени
	Строка toString();
	
}
