/*
 * Авторское право принадлежит Антону Александровичу Астафьеву <anton@astafiev.me> ѱ 2017.
 * Все права защищены и охраняются законом.
 * Copyright (c) 2017 Anton Astafiev <anton@astafiev.me>. All rights reserved.
 *
 *  Собственная лицензия Астафьева
 * Данный программный код является собственностью Астафьева Антона Александровича
 * и может быть использован только с его личного разрешения
 */

пакет эллиптика.ява.морфология;

/**
 *
 * @автор Антон Александрович Астафьев {@буквально <anton@astafiev.me>} (Anton Astafiev)
 */
доступный итоговый класс Сложение {

	доступный статичный переч Слитность {
		СЛИТНОЕ, СОСТАВНОЕ
	}

	доступный статичный переч Характер {
		СИНТАКСИЧЕСКОЕ, МОРФОЛОГИЧЕСКОЕ
	}

}
