/*
 * Авторское право принадлежит Антону Александровичу Астафьеву <anton@astafiev.me> ѱ 2017.
 * Все права защищены и охраняются законом.
 * Copyright (c) 2017 Anton Astafiev <anton@astafiev.me>. All rights reserved.
 *
 *  Собственная лицензия Астафьева
 * Данный программный код является собственностью Астафьева Антона Александровича
 * и может быть использован только с его личного разрешения
 */

пакет эллиптика.ява.морфемика;

внеся java.util.Коллекции;
внеся java.util.Множество;

/**
 *
 * @автор Антон Астафьев
 */
доступный абстрактный класс КонцевойАффикс расширяет ТиповаяМорфема {
	@Подмени
	доступный итоговый Множество<ТипМорфемы> ставитсяПеред() {
		верни Коллекции.ПУСТОЕ_МНОЖЕСТВО;
	}

}
