/*
 *  Авторское право принадлежит Антону Александровичу Астафьеву <anton@astafiev.me> ѱ 2017.
 *  Все права защищены и охраняются законом.
 *  Copyright (c) 2017 Anton Astafiev <anton@astafiev.me>. All rights reserved.
 * 
 *   Собственная лицензия Астафьева
 *  Данный программный код является собственностью Астафьева Антона Александровича
 *  и может быть использован только с его личного разрешения
 */

пакет эллиптика.ява.морфемика;

/**
 *
 * @автор Антон Астафьев
 */
доступный переч ТипМорфемы {
	ПРИСТАВКА,
	КОРЕНЬ,
	ИНТЕРФИКС,
	ИНФИКС,
	ДИСФИКС,
	СУФФИКС,
	КОНФИКС,
	ОКОНЧАНИЕ,
	ПОСТФИКС,
	ПРЕФИКСОИД,
	СУФФИКСОИД,
	КОНФИКСОИД,
	СЫРАЯ,
}
