/*
 *  Лицензия Астафьева
 * Данный программный код является собственностью Астафьева Антона Александровича
 * и может быть использован только с его личного разрешения
 */

пакет org.elliptica.ling;

внеся java.util.Коллекции;
внеся java.util.Список;
внеся java.util.Множество;

/**
 *
 * @author Антон Астафьев <anton@astafiev.me> (Anton Astafiev)
 */
класс ПарадигмаНормальная расширяет БазаПарадигмы {
	личный итоговый Множество<Граммема> множествоГраммем;
	личный итоговый Строка базоваяФорма;

	доступный ПарадигмаНормальная(логическое найдено, ЧастьРечи чречи, Множество<Граммема> множествоГраммем, Строка базоваяФорма) {
		поверх(найдено, чречи);
		это.множествоГраммем = множествоГраммем;
		это.базоваяФорма = базоваяФорма;
	}

	@Подмени
	доступный Множество<Граммема> дайГраммемы() {
		верни множествоГраммем;
	}

	@Подмени
	доступный Строка дайБазовуюФорму() {
		верни базоваяФорма;
	}

	@Подмени
	доступный Список<ФормаСлова> формы() {
		верни Коллекции.ПУСТОЙ_СПИСОК;
	}

}
